In [1]:
import pandas as pd

bal=pd.read_csv('data/melonbal.csv', encoding='cp949')
dan=pd.read_csv('data/melondan.csv', encoding='cp949')
hip=pd.read_csv('data/melonhip.csv', encoding='cp949')
rb=pd.read_csv('data/melonr_b.csv', encoding='cp949')
indi=pd.read_csv('data/melonindi.csv', encoding='cp949')
rock=pd.read_csv('data/melonrock.csv', encoding='cp949')
tst=pd.read_csv('data/melontwist.csv', encoding='cp949')
bf=pd.read_csv('data/melonbluefork.csv', encoding='cp949')

###### 제목,랭크 없애기

In [2]:
bal=bal.drop([' 제목'], axis=1)
bal=bal.drop(['랭크'], axis=1)
dan=dan.drop([' 제목'], axis=1)
dan=dan.drop(['랭크'], axis=1)
hip=hip.drop([' 제목'], axis=1)
hip=hip.drop(['랭크'], axis=1)
rb=rb.drop([' 제목'], axis=1)
rb=rb.drop(['랭크'], axis=1)
indi=indi.drop([' 제목'], axis=1)
indi=indi.drop(['랭크'], axis=1)
rock=rock.drop([' 제목'], axis=1)
rock=rock.drop(['랭크'], axis=1)
tst=tst.drop([' 제목'], axis=1)
tst=tst.drop(['랭크'], axis=1)
bf=bf.drop([' 제목'], axis=1)
bf=bf.drop(['랭크'], axis=1)

###### 봄 여름 가을 겨울 (1,2,3,4)

In [3]:
bal.loc[(bal['발매월']>=3) & (bal['발매월']<=5), 'date']=1
bal.loc[(bal['발매월']>=6) & (bal['발매월']<=8), 'date']=2
bal.loc[(bal['발매월']>=9) & (bal['발매월']<=11), 'date']=3
bal=bal.fillna(4)
bal=bal.drop(['발매월'], axis=1)

dan.loc[(dan['발매월']>=3) & (dan['발매월']<=5), 'date']=1
dan.loc[(dan['발매월']>=6) & (dan['발매월']<=8), 'date']=2
dan.loc[(dan['발매월']>=9) & (dan['발매월']<=11), 'date']=3
dan=dan.fillna(4)
dan=dan.drop(['발매월'], axis=1)

hip.loc[(hip['발매월']>=3) & (hip['발매월']<=5), 'date']=1
hip.loc[(hip['발매월']>=6) & (hip['발매월']<=8), 'date']=2
hip.loc[(hip['발매월']>=9) & (hip['발매월']<=11), 'date']=3
hip=hip.fillna(4)
hip=hip.drop(['발매월'], axis=1)

rb.loc[(rb['발매월']>=3) & (rb['발매월']<=5), 'date']=1
rb.loc[(rb['발매월']>=6) & (rb['발매월']<=8), 'date']=2
rb.loc[(rb['발매월']>=9) & (rb['발매월']<=11), 'date']=3
rb=rb.fillna(4)
rb=rb.drop(['발매월'], axis=1)

indi.loc[(indi['발매월']>=3) & (indi['발매월']<=5), 'date']=1
indi.loc[(indi['발매월']>=6) & (indi['발매월']<=8), 'date']=2
indi.loc[(indi['발매월']>=9) & (indi['발매월']<=11), 'date']=3
indi=indi.fillna(4)
indi=indi.drop(['발매월'], axis=1)

rock.loc[(rock['발매월']>=3) & (rock['발매월']<=5), 'date']=1
rock.loc[(rock['발매월']>=6) & (rock['발매월']<=8), 'date']=2
rock.loc[(rock['발매월']>=9) & (rock['발매월']<=11), 'date']=3
rock=rock.fillna(4)
rock=rock.drop(['발매월'], axis=1)

tst.loc[(tst['발매월']>=3) & (tst['발매월']<=5), 'date']=1
tst.loc[(tst['발매월']>=6) & (tst['발매월']<=8), 'date']=2
tst.loc[(tst['발매월']>=9) & (tst['발매월']<=11), 'date']=3
tst=tst.fillna(4)
tst=tst.drop(['발매월'], axis=1)

bf.loc[(bf['발매월']>=3) & (bf['발매월']<=5), 'date']=1
bf.loc[(bf['발매월']>=6) & (bf['발매월']<=8), 'date']=2
bf.loc[(bf['발매월']>=9) & (bf['발매월']<=11), 'date']=3
bf=bf.fillna(4)
bf=bf.drop(['발매월'], axis=1)

In [4]:
bal.head()

   타입 성별   date
0  그룹  남성   1.0
1  솔로  여성   4.0
2  솔로  여성   1.0
3  솔로  남성   3.0
4  그룹  혼성   3.0

In [5]:
dan.head()

   타입  성별   date
0  솔로   여성   4.0
1  솔로   여성   4.0
2  솔로   여성   3.0
3  그룹   여성   3.0
4  그룹   남성   3.0

In [6]:
hip.head()

   타입  성별   date
0  솔로   남성   2.0
1  솔로   남성   3.0
2  솔로   남성   2.0
3  솔로   남성   3.0
4  그룹   남성   1.0

In [7]:
rb.head()

   타입  성별   date
0  솔로   남성   4.0
1  솔로   남성   3.0
2  솔로   여성   4.0
3  솔로   남성   3.0
4  그룹   남성   2.0

In [8]:
indi.head()

   타입  성별                                                  가사  date
0  솔로   남성  서러운 맘을 못 이겨 잠 못 들던 어둔 밤을 또 견디고 내 절망관 상관없이 무심하게...   3.0
1  그룹   남성  나도 알아 나의 문제가 무엇인지 난 못났고 별 볼 일 없지 그 애가 나를 부끄러워 ...   3.0
2  그룹   남성  비틀비틀 걸어가는 나의 다리 오늘도 의미없는 또 하루가 흘러가죠 사랑도 끼리끼리 하...   3.0
3  그룹   남성  Tonight 널 바래다 주는 길 내내 내가 변했다고 말하지 널 생각하지 않는다고 ...   3.0
4  솔로   남성  벌써 몇 달 짼가 너 만난다는 그 사람 얘길 들었어 아마 뭔 일이 있었나 저쨌나 떠...   4.0

In [9]:
rock.head()

   타입  성별   date
0  그룹   남성   1.0
1  솔로   남성   3.0
2  그룹   남성   3.0
3  그룹   남성   2.0
4  그룹   남성   3.0

In [10]:
tst.head()

   타입  성별   date
0  솔로   여성   1.0
1  솔로   여성   1.0
2  솔로   여성   3.0
3  솔로   남성   3.0
4  솔로   여성   3.0

In [11]:
bf.head()

   타입  성별   date
0  솔로   남성   3.0
1  솔로   남성   2.0
2  그룹   혼성   3.0
3  그룹   남성   3.0
4  그룹   혼성   1.0

###### 솔로, 그룹 (0,1)

In [12]:
bal.loc[bal[' 타입']=='솔로', 'type']=1
bal.loc[bal[' 타입']=='그룹', 'type']=2
bal=bal.drop([' 타입'], axis=1)

dan.loc[dan[' 타입']=='솔로', 'type']=1
dan.loc[dan[' 타입']=='그룹', 'type']=2
dan=dan.drop([' 타입'], axis=1)

hip.loc[hip[' 타입']=='솔로', 'type']=1
hip.loc[hip[' 타입']=='그룹', 'type']=2
hip=hip.drop([' 타입'], axis=1)

rb.loc[rb[' 타입']=='솔로', 'type']=1
rb.loc[rb[' 타입']=='그룹', 'type']=2
rb=rb.drop([' 타입'], axis=1)

indi.loc[indi[' 타입']=='솔로', 'type']=1
indi.loc[indi[' 타입']=='그룹', 'type']=2
indi=indi.drop([' 타입'], axis=1)

rock.loc[rock[' 타입']=='솔로', 'type']=1
rock.loc[rock[' 타입']=='그룹', 'type']=2
rock=rock.drop([' 타입'], axis=1)

tst.loc[tst[' 타입']=='솔로', 'type']=1
tst.loc[tst[' 타입']=='그룹', 'type']=2
tst=tst.drop([' 타입'], axis=1)

bf.loc[bf[' 타입']=='솔로', 'type']=1
bf.loc[bf[' 타입']=='그룹', 'type']=2
bf=bf.drop([' 타입'], axis=1)

###### 남성, 여성, 혼성 (1, 2, 3)

In [13]:
bal.loc[bal['성별 ']=='남성', 'sex']=1
bal.loc[bal['성별 ']=='여성', 'sex']=2
bal.loc[bal['성별 ']=='혼성', 'sex']=3
bal=bal.drop(['성별 '], axis=1)

dan.loc[dan[' 성별 ']=='남성', 'sex']=1
dan.loc[dan[' 성별 ']=='여성', 'sex']=2
dan.loc[dan[' 성별 ']=='혼성', 'sex']=3
dan=dan.drop([' 성별 '], axis=1)

hip.loc[hip[' 성별 ']=='남성', 'sex']=1
hip.loc[hip[' 성별 ']=='여성', 'sex']=2
hip.loc[hip[' 성별 ']=='혼성', 'sex']=3
hip=hip.drop([' 성별 '], axis=1)

rb.loc[rb[' 성별 ']=='남성', 'sex']=1
rb.loc[rb[' 성별 ']=='여성', 'sex']=2
rb.loc[rb[' 성별 ']=='혼성', 'sex']=3
rb=rb.drop([' 성별 '], axis=1)

indi.loc[indi[' 성별 ']=='남성', 'sex']=1
indi.loc[indi[' 성별 ']=='여성', 'sex']=2
indi.loc[indi[' 성별 ']=='혼성', 'sex']=3
indi=indi.drop([' 성별 '], axis=1)

rock.loc[rock[' 성별 ']=='남성', 'sex']=1
rock.loc[rock[' 성별 ']=='여성', 'sex']=2
rock.loc[rock[' 성별 ']=='혼성', 'sex']=3
rock=rock.drop([' 성별 '], axis=1)

tst.loc[tst[' 성별 ']=='남성', 'sex']=1
tst.loc[tst[' 성별 ']=='여성', 'sex']=2
tst.loc[tst[' 성별 ']=='혼성', 'sex']=3
tst=tst.drop([' 성별 '], axis=1)

bf.loc[bf[' 성별 ']=='남성', 'sex']=1
bf.loc[bf[' 성별 ']=='여성', 'sex']=2
bf.loc[bf[' 성별 ']=='혼성', 'sex']=3
bf=bf.drop([' 성별 '], axis=1)

###### 발라드, 댄스, 힙합, 알앤비, 인디, 락, 트로트, 블루스 (1,2,3,4,5,6,7,8)

In [14]:
bal['genre']=1.0
dan['genre']=2.0
hip['genre']=3.0
rb['genre']=4.0
indi['genre']=5.0
rock['genre']=6.0
tst['genre']=7.0
bf['genre']=8.0

In [15]:
bal

     date  type  sex  genre
0     1.0   2.0  1.0    1.0
1     4.0   1.0  2.0    1.0
2     1.0   1.0  2.0    1.0
3     3.0   1.0  1.0    1.0
4     3.0   2.0  3.0    1.0
..    ...   ...  ...    ...
245   1.0   1.0  1.0    1.0
246   4.0   1.0  1.0    1.0
247   3.0   1.0  2.0    1.0
248   4.0   2.0  2.0    1.0
249   1.0   1.0  2.0    1.0

[250 rows x 4 columns]

In [16]:
dan

     date  type  sex  genre
0     4.0   1.0  2.0    2.0
1     4.0   1.0  2.0    2.0
2     3.0   1.0  2.0    2.0
3     3.0   2.0  2.0    2.0
4     3.0   2.0  1.0    2.0
..    ...   ...  ...    ...
245   2.0   2.0  1.0    2.0
246   4.0   1.0  2.0    2.0
247   2.0   1.0  1.0    2.0
248   3.0   2.0  2.0    2.0
249   3.0   2.0  2.0    2.0

[250 rows x 4 columns]

In [17]:
hip

     date  type  sex  genre
0     2.0   1.0  1.0    3.0
1     3.0   1.0  1.0    3.0
2     2.0   1.0  1.0    3.0
3     3.0   1.0  1.0    3.0
4     1.0   2.0  1.0    3.0
..    ...   ...  ...    ...
245   3.0   1.0  1.0    3.0
246   3.0   1.0  1.0    3.0
247   2.0   2.0  1.0    3.0
248   3.0   1.0  1.0    3.0
249   2.0   1.0  1.0    3.0

[250 rows x 4 columns]

In [18]:
rb

     date  type  sex  genre
0     4.0   1.0  1.0    4.0
1     3.0   1.0  1.0    4.0
2     4.0   1.0  2.0    4.0
3     3.0   1.0  1.0    4.0
4     2.0   2.0  1.0    4.0
..    ...   ...  ...    ...
245   3.0   1.0  2.0    4.0
246   3.0   1.0  1.0    4.0
247   3.0   1.0  1.0    4.0
248   3.0   2.0  2.0    4.0
249   2.0   1.0  1.0    4.0

[250 rows x 4 columns]

In [19]:
indi

                                                    가사  date  type  sex  genre
0    서러운 맘을 못 이겨 잠 못 들던 어둔 밤을 또 견디고 내 절망관 상관없이 무심하게...   3.0   1.0  1.0    5.0
1    나도 알아 나의 문제가 무엇인지 난 못났고 별 볼 일 없지 그 애가 나를 부끄러워 ...   3.0   2.0  1.0    5.0
2    비틀비틀 걸어가는 나의 다리 오늘도 의미없는 또 하루가 흘러가죠 사랑도 끼리끼리 하...   3.0   2.0  1.0    5.0
3    Tonight 널 바래다 주는 길 내내 내가 변했다고 말하지 널 생각하지 않는다고 ...   3.0   2.0  1.0    5.0
4    벌써 몇 달 짼가 너 만난다는 그 사람 얘길 들었어 아마 뭔 일이 있었나 저쨌나 떠...   4.0   1.0  1.0    5.0
..                                                 ...   ...   ...  ...    ...
244  휴일을 앞둔 밤에 아무도 없는 새벽 도로를 질주해서 바닷가에 아직은 어두운 하늘 천...   3.0   2.0  1.0    5.0
245  여전히 말하지 못한 내 속마음과 그대와 돌아가는 이 시곗바늘 어쩌면 이 모든 낯설음...   2.0   1.0  1.0    5.0
246  오 젊은 사랑 그것은 너무도 잔인한 것 어린 맘에 몸을 실었던 내가 더 잔인한가 모...   1.0   2.0  3.0    5.0
247  일주일간 연락이 없다 어느 밤 보고 싶다거나 뭐 하냐고 하는 깃털 같은 말에 기대하...   2.0   1.0  2.0    5.0
248  그렇게 사라져 가는데 아무것도 할 수 없었네 잊을 수 없을 것만 같던 순간도 희미해...   2.0   2.0  1.0    5.0

[249 rows x 5 columns]

In [20]:
rock

     date  type  sex  genre
0     1.0   2.0  1.0    6.0
1     3.0   1.0  1.0    6.0
2     3.0   2.0  1.0    6.0
3     2.0   2.0  1.0    6.0
4     3.0   2.0  1.0    6.0
..    ...   ...  ...    ...
264   2.0   2.0  3.0    6.0
265   1.0   2.0  1.0    6.0
266   4.0   1.0  2.0    6.0
267   1.0   2.0  1.0    6.0
268   3.0   2.0  1.0    6.0

[269 rows x 4 columns]

In [21]:
tst

     date  type  sex  genre
0     1.0   1.0  2.0    7.0
1     1.0   1.0  2.0    7.0
2     3.0   1.0  2.0    7.0
3     3.0   1.0  1.0    7.0
4     3.0   1.0  2.0    7.0
..    ...   ...  ...    ...
241   3.0   1.0  1.0    7.0
242   3.0   1.0  1.0    7.0
243   4.0   1.0  2.0    7.0
244   3.0   1.0  1.0    7.0
245   2.0   2.0  2.0    7.0

[246 rows x 4 columns]

In [22]:
bf

     date  type  sex  genre
0     3.0   1.0  1.0    8.0
1     2.0   1.0  1.0    8.0
2     3.0   2.0  3.0    8.0
3     3.0   2.0  1.0    8.0
4     1.0   2.0  3.0    8.0
..    ...   ...  ...    ...
242   3.0   2.0  1.0    8.0
243   3.0   1.0  1.0    8.0
244   4.0   1.0  2.0    8.0
245   3.0   2.0  3.0    8.0
246   2.0   2.0  3.0    8.0

[247 rows x 4 columns]

In [23]:
import csv
import random
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np

In [24]:
mel=pd.concat([bal,dan,hip,rb,indi,rock,tst,bf])
N=len(mel)
ratio=0.7
np.random.seed(0)
train=np.random.choice(np.arange(N), np.int(ratio*N), replace=False)
test=list(set(np.arange(N)).difference(train))

C:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [25]:
train=mel.iloc[train]
test=mel.iloc[test]

In [26]:
x_train=train[['date','type','sex']]
y_train=train['genre']
x_train=x_train.fillna('0')
x_test=test[['date', 'type','sex']]
x_test=x_test.fillna('0')

In [27]:
from sklearn.tree import DecisionTreeClassifier

tree1=DecisionTreeClassifier()
tree1.fit(x_train,y_train)
print(tree1.score(x_train,y_train))

0.30206112295664533

In [28]:
from sklearn.ensemble import RandomForestClassifier

forest=RandomForestClassifier(n_estimators=8)
forest.fit(x_train, y_train)
print(forest.score(x_train,y_train))

0.29850746268656714

In [29]:
from sklearn.pipeline import Pipeline
from sklearn.preprocessing import PolynomialFeatures
from sklearn.preprocessing import StandardScaler
from sklearn.svm import LinearSVC

In [30]:
polynomial_svm_clf=Pipeline([('poly_features',PolynomialFeatures(degree=3)),('scaler',StandardScaler()),
                             ('svm_clf',LinearSVC(C=10,loss='hinge', max_iter=2000))])

In [31]:
polynomial_svm_clf.fit(x_train,y_train)

C:\anaconda\lib\site-packages\sklearn\svm\_base.py:947: ConvergenceWarning: Liblinear failed to converge, increase the number of iterations.
  "the number of iterations.", ConvergenceWarning)

Pipeline(memory=None,
         steps=[('poly_features',
                 PolynomialFeatures(degree=3, include_bias=True,
                                    interaction_only=False, order='C')),
                ('scaler',
                 StandardScaler(copy=True, with_mean=True, with_std=True)),
                ('svm_clf',
                 LinearSVC(C=10, class_weight=None, dual=True,
                           fit_intercept=True, intercept_scaling=1,
                           loss='hinge', max_iter=2000, multi_class='ovr',
                           penalty='l2', random_state=None, tol=0.0001,
                           verbose=0))],
         verbose=False)